# nthº Pipeline - Cisco ASA version 0.7.0 (9)
# transforms.conf: packaged 01/25/2024 by Duck Yeah! version 2.0.0
# Please do not modify this header manually. It is required by Duck Yeah!.
#
# Want Duck Yeah!? Download from Splunkbase: https://splunkbase.splunk.com/app/7015
#
# Contributors: 
# +Paul Stout <paul@nthdegree.io>

[extract_cisco_asa_fields]
DELIMS = ","
FIELDS = access_group,access_list,action,asa_code,bytes_in,bytes,bytes_out,cmd,command,dest_host,dest_interface,dest_ip,dest_nt_domain,dest_port,dest_sg_info,dest_translated_host,dest_translated_ip,dest_translated_port,dest_user,data,direction,group,dur,duration_day,duration_hour,duration_minute,duration_second,group_policy,hash_codes,filename,hit_cnt,hit_cnt_interval,icmp_code,icmp_type,idfw_user,interface,interface_name,ip_address,ip_options,limit_num,list_id,object,orig_transport,orig_dest_ip,orig_src_ip,reason,reason_ALT,role,rule_id,session_id,size,signature,source,source_app,src_interface,src_host,src_ip,src_nt_domain,src_port,src_translated_host,src_translated_ip,src_translated_port,src_sg_info,src_user,status,teardown_initiator,threat_level,threat_category,transport,user,user_ALT,url
